[
{"title": "Frito Pie", "author": "Lena Abraham", "introduction": "Originally created in Mexico but popularized in the American Southwest, Frito Pies (not ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a large pot over medium heat, heat oil. Add half onion and cook until soft, about 5 minutes. Stir in garlic and cook until fragrant, about 1 minute more, then add tomato paste, stirring to combine. Add ground beef and cook until no longer pink. Drain fat and return to heat.</li><li>Add chili powder, cumin, oregano, cayenne, and season generously with salt and pepper. Pour in crushed tomatoes, pinto beans, and green chili and bring chili to a boil. Reduce heat and simmer 20 minutes. Season with more salt and pepper, if necessary.</li><li>Build Frito pie: open bag(s) and ladle in chili. Top with cheddar, remaining chopped white onions, jalapeños, and sour cream if using. </li></ol></div>"},
{"title": "Bloody Mary", "author": "Laura Rege", "introduction": "A Bloody Mary is the ever popular ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a large pitcher combine tomato juice, vodka, pickle juice, lemon juice, horseradish, Worcestershire sauce, hot sauce, and celery seeds. Season with a couple grinds of black pepper. </li><li>Fill glasses with ice and top with bloody mary mixture, a dill pickle, celery stalk, lemon wedge, and olives.</li></ol></div>"},
{"title": "Twice Baked Potato Casserole", "author": "Laura Rege", "introduction": " get turned into a creamy, cheesy casserole that instantly become everyone's favorite side. It's an easy no fuss way to turn simple baked potatoes into something extravagant. ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Preheat oven to 400°. Place potatoes directly on rack and bake until soft and easily pierced with the tip of a knife, 1 hour to 1 hour, 15 minutes, depending on size. Remove from oven and let cool slightly. </li><li>Slice warm potatoes in half and remove flesh with a spoon and place in a large bowl; discard skin. </li><li>Mash flesh and add butter, cream cheese, sour cream and milk and stir to combine and until butter and cream cheese is melted. Fold in 2 cups cheddar, three quarters of the bacon, three quarters of the chopped green onion, and garlic powder. Season with salt and pepper.</li><li>Brush a medium baking dish with butter and scrape potato mixture into dish. Sprinkle with remaining 3/4 cup cheddar cheese and bake until cheese is melty, about 20 minutes. Turn oven to broil and broil until golden, about 2 minutes. Let cool 10 minutes. </li><li>Top with remaining bacon and green onions.</li></ol></div>"},
{"title": "Mashed Butternut Squash", "author": "Lauren Miyashiro", "introduction": "Butternut squash has an advantage on potatoes when it comes to a puree. After roasting, butternut squash becomes extremely smooth and creamy. Instead of the added milk or cream, the squash gets blended with a little butter for a velvety smooth side dish. It's one of our favorite ways to serve the vegetable and it takes very little effort! Need help cutting butternut squash? No fret! We have a great guide on ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Preheat oven to 400°. On a large baking sheet, toss butternut squash with oil and season with salt and pepper. </li><li>Roast until squash is extremely tender, tossing halfway through, about 30 minutes.</li><li>Place squash and butter into the bowl of a food processor and blend until smooth. </li><li>Serve with a pinch of cayenne pepper, if using. </li></ol></div>"},
{"title": "Instant Pot Applesauce", "author": "Lena Abraham", "introduction": "No standing over the stove and stirring with this insanely easy applesauce! We like ours on the less-sweet side, but if you're finding yours a little too tart, you can always stir in more sugar after they've been cooked. Best served alongside some freshly fried ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> Combine all ingredients in instant pot and stir to mix.</li><li>Secure instant pot lid and pressure cook on high for 5 minutes.<br></li><li>Let natural release for 10 minutes, then follow manufacturer's instructions for quick release for remaining steam. Remove lid, stir, and serve.</li></ol></div>"},
{"title": "Panera Autumn Squash Soup", "author": "Lauren Miyashiro", "introduction": "Panera has a cult following around their soups and especially their autumn squash soup. Our copycat version has butternut squash, pumpkin, carrots, and shallots for a sweet and fully fall flavor. Topped with spiced pepitas this soup is great as an appetizer or filling enough to be the main course. ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a large pot over medium heat, heat oil. Add squash, carrots, and shallots and season with salt and pepper. Cook, stirring occasionally, until beginning to soften, about 5 minutes. Stir in garlic, sugar, ginger, and curry powder, and cook until vegetables are beginning to caramelize, about 2 minutes more. </li><li>Pour over broth, apple juice, and water. Bring to a boil, then reduce to a simmer and cook until vegetables are soft, about 10 minutes. </li><li>Meanwhile, in a small bowl, whisk together pumpkin puree and cream cheese until incorporated. </li><li>Pour pumpkin mixture into pot and stir to combine. </li><li>Using an immersion blender, puree soup until smooth. Season with salt and pepper and stir in desired amount of heavy cream, if using. Serve soup topped with pepitas. </li></ol></div>"},
{"title": "Shoofly Pie", "author": "Lena Abraham", "introduction": "So, what exactly IS a Shoofly Pie? Well, it's a lot of things. Somewhere between cake, pie, crumble, and ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> Preheat oven to 400°. Lightly grease a 9” pie dish with cooking spray.</li><li>On a lightly floured surface, roll out dough into a 12” circle. Drape over pie dish and gently press to fit (don’t stretch). Prick bottom with a fork, trim edge to 1”, tuck overhang under itself, and crimp the edges. Chill in the fridge for 30 minutes or freezer for 10 minutes.</li><li>Line crust with parchment paper and fill with dried beans or pie weights. Blind bake until edges are lightly golden, 18 to 20 minutes, then remove parchment and weights and bake 10 to 15 minutes more, until golden and fully baked. Reduce oven temperature to 350° and let pie crust cool completely.</li><li>In a large, heat-safe bowl, combine boiling water, molasses, cinnamon, ginger, cloves, and baking soda. Let cool 10 minutes. </li><li> Meanwhile, in a medium bowl or in the bowl of a food processor, whisk to combine flour, brown sugar, and salt. Add butter and process or cut in with a pastry cutter until mixture resembles coarse sand.</li><li>Fill cooled pie crust with molasses mixture. Add flour mixture to pie in an even layer and bake until completely set, 25 to 30 minutes. Let cool completely before slicing and serving.</li></ol></div>"},
{"title": "Fried Ice Cream Cake", "author": "Laura Rege", "introduction": "This dessert brings ice cream to the next level. And it all starts with caramelizing some crispy cereal in a perfectly preheated T-fal pan. Thanks to their Thermo-Spot technology, there is no more guessing in when your pan is ready! Get ready to indulge in this nostalgic cake that is the best 'fried ice cream' you'll ever have.", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Make the cake: Preheat a <a href=\"https://www.amazon.com/T-fal-Signature-Thermo-Spot-Indicator-12-25-Inch/dp/B0013K03XK/ref=sr_1_5?keywords=t-fal+signature+nonstick+12.5+in.+fry+pan&amp;qid=1568822465&amp;s=gateway&amp;sr=8-5\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.amazon.com/T-fal-Signature-Thermo-Spot-Indicator-12-25-Inch/dp/B0013K03XK/ref=sr_1_5?keywords=t-fal+signature+nonstick+12.5+in.+fry+pan&amp;qid=1568822465&amp;s=gateway&amp;sr=8-5\" data-affiliate=\"true\">large T-fal 12\" nonstick skillet</a> over medium heat, until the Thermo-Spot turns solid. Melt butter in preheated skillet and add sugars, cinnamon, and a large pinch of salt, stirring to combine. </li><li>Add corn flakes and cook, tossing, until cereal is coated and lightly toasted and cinnamon is fragrant, about 3 minutes. Scrape toasted flakes onto a rimmed baking sheet and spread into a single layer. Let cool. </li><li>Spray the bottom and sides of a 9\" cake pan with cooking spray and line with a few pieces of plastic wrap, leaving at least a few inches overhang on all sides. </li><li>Dollop strawberry ice cream in the bottom of the prepared pan and smooth the top. Sprinkle evenly with 1 ¼ cups of cereal mixture. Dollop chocolate ice cream over the cereal layer, smooth the top, and sprinkle evenly with another 1 ¼ cups of cereal mixture. Dollop vanilla ice cream over the cereal layer and smooth the top.</li><li>Using your hands, break 1 cup of the remaining cereal mixture into finer crumbs and press into vanilla layer to create a crust.</li><li>Cover top of cake pan with a piece of plastic wrap and freeze until firm, at least 5 hours and up to overnight. Reserve remaining cereal mixture in an airtight container for topping the cake.</li><li>Meanwhile, make the hot fudge sauce: Heat a large nonstick T-fal skillet over medium heat until the Thermo-Spot turns a solid red. Add heavy cream, cocoa powder, light corn syrup, and butter and cook, stirring until butter is melted and everything is combined, about 2 minutes. Remove from heat and stir in chocolate chips, until melted. Stir in vanilla and salt. Serve warm, or chill and reheat before serving.</li><li>To serve, using the overhang of the plastic wrap, lift cake out of pan. Flip upside down onto a platter, unwrap, and discard plastic wrap. Let soften slightly to make slicing easier, about 10 minutes.</li><li>Top cake with reserved cereal mixture and slice. Dollop each slice with whipped cream, a drizzle of fudge sauce, and top with a cherry.</li></ol></div>"},
{"title": "Tamale Pie Stuffed Peppers", "author": "Lena Abraham", "introduction": "Everyone loves a good ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> In a large skillet over medium heat, heat oil. Add onion, season with salt pepper, and cook until soft, 6 minutes. Add garlic and cook until fragrant, 1 minute more. Add ground beef and cook, breaking up meat with a wooden spoon, until no longer pink, about 6 minutes. Drain fat. </li><li>Return skillet to heat and add tomato paste, cumin, and chili powder. Cook until tomato paste has darkened in color and spices are fragrant, 1 to 2 minutes. And enchilada sauce and bring to a simmer. Cook until mixture has thickened slightly, 3 to 4 minutes.</li><li>Preheat oven to 400°. Prepare cornbread base: In a medium bowl, combine corn muffin mix, corn, sour cream, butter, and eggs and whisk until evenly combined.</li><li>Place peppers cut side up in a 9\"-x-13\" baking dish. Divide beef mixture evenly between peppers, followed by a layer of cheddar, a layer of cornbread, and a layer of Monterey Jack. Cover dish with foil and bake for 45 minutes, then remove foil and bake 25 to 27 minutes more, until peppers are tender and cornbread is baked through. Garnish with sour cream and green onions and serve.</li></ol></div>"},
{"title": "French Onion Dip", "author": "Laura Rege", "introduction": "Sour cream and onion dip is always a crowdpleaser. But this hot caramelized onion cheese dip reaches a whole new level of amazingness. If you don't have sherry, you can swap in a splash of red or white wine. ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Preheat oven to 350°. In a large skillet over medium heat, melt butter. Add onion and season with salt and pepper. Reduce heat to medium-low and cook, stirring occasionally, until caramelized and jammy, about 20 minutes.</li><li>Increase heat to medium-high, stir in sherry and thyme and simmer until almost completely reduced, about 2 minutes. Remove from heat.</li><li>In a large bowl, stir together cream cheese, sour cream, mayonnaise, and cheeses. Mix in caramelized onions and season with salt and pepper. Transfer to a baking dish set on a small baking sheet and smooth top with a spatula. Top with more shredded cheeses.</li><li>Bake until bubbly and slightly golden, about 30 minutes. If you’d like the dip to develop a more golden top, broil on high for 2 minutes.</li><li>Serve with baguette on the side, for dipping. </li></ol></div>"},
{"title": "Twice Baked Sweet Potatoes", "author": "Lena Abraham", "introduction": "We love a good ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> Preheat oven to 375°. Pat potatoes completely dry with paper towels. Poke potatoes all over with a fork, then rub with oil and sprinkle with salt. Place directly on oven racks and bake until pierced easily with a fork, about 1 hour. Place on a large baking sheet and let cool until cool enough to handle. </li><li>Cut a thin layer off the top of each potato lengthwise. Scoop inside out of each potato leaving a ½” border. Place insides in large bowl. (You can keep the potato tops and roast them on the tray as a snack!) </li><li>Into the bowl with the potatoes, add milk, sour cream, and butter. Mash until all ingredients are incorporated and mixture is mostly smooth. Fold in 1 cup cheese, black beans, green onions, and garlic and season with salt. </li><li>Fill baked potatoes with mixture and place on a large baking sheet. Top with remaining ½ cup of cheese. Bake until cheese is melty and outside is crispy, 15 minutes. </li><li>Top with tomatoes, avocado, jalapeño, and queso fresco before serving.</li></ol></div>"},
{"title": "Apple Jam", "author": "Lena Abraham", "introduction": "Got a lot of apples and don't know what to do with them? If ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> Place a small plate in your freezer. Peel, core, and roughly chop your apples into ¾” to 1\" pieces.</li><li>Combine apples with 1½ cups water in a heavy bottomed pot or sauce pan over medium-high heat. Bring to a simmer, stirring occasionally, and cook until fruit is tender and mixture has reduced by ¼, about 15 minutes. </li><li>Add the sugar, reduce heat to medium, and cook, stirring frequently, until mixture is jammy and thick, about 25 minutes more.</li><li>Add lemon juice and cinnamon stick if using, and stir to incorporate. Simmer 5 to 7 more minutes to allow cinnamon to infuse. To test if jam is ready, place a small spoonful onto prepared cold plate. Let sit 2 minutes, then drag your finger through the spoonful of jam. If it holds its shape, it's good to go! If it appears runny or watery, continue cooking.</li><li>When jam has reached desired consistency, remove cinnamon stick. Divide between clean jars, and seal tightly. Refrigerate. Jam will last up to 2 weeks.</li></ol></div>"},
{"title": "Apple Cider Donuts", "author": "Laura Rege", "introduction": "Apple cider donuts are a must when you go apple picking. But they shouldn't be reserved to your time at the orchards—that's much too limited! Though time consuming, they're easy enough for anyone to make from home. Here's what you need to know. ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a medium saucepan over medium-high heat, bring apple cider to a boil. Continue to boil until reduced to ¾ cup, about 15 minutes. Pour into a large heatproof bowl and let cool to room temperature.</li><li>In a large bowl, whisk together flour, brown sugar, cinnamon, baking powder, ¾ teaspoon salt, and baking soda. Whisk butter and egg into cooled apple cider. Add dry ingredients to wet and stir until just combined. </li><li>Cover bowl with plastic and refrigerate until dough is cold and firm, about 1 hour.</li><li>On a floured surface, roll chilled dough into a ½“ thick rectangle, lightly flouring as necessary. Using a doughnut cutter or 3” and 1” biscuit cutters, punch out doughnuts. Bring scraps together and punch out as well. Place doughnuts and holes onto baking sheets, cover with dish towel.</li><li>Place cinnamon sugar in a shallow bowl. Heat ½\" oil in a large stockpot or Dutch oven over medium-high heat until a deep-fry thermometer registers 350°. </li><li>Working in batches, add donuts to Dutch oven and cook until evenly golden and crispy, 1 to 2 minutes per side, adjusting heat as necessary to maintain frying temperature between 350° and 375°.</li><li>Transfer to a paper towel-lined plate for 30 seconds, then roll warm donuts in cinnamon sugar mixture to coat.</li></ol></div>"},
{"title": "Pumpkin Pie Dip", "author": "Joanna Saltz", "introduction": "All the flavors you love about ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a stand mixer, beat heavy cream and vanilla pudding mix until stiff peaks form, 1 to 2 minutes. </li><li>Add pumpkin and pumpkin pie spice and stir to combine, then chill if desired. Serve with ginger snaps.</li></ol></div>"},
{"title": "Rum & Coke", "author": "Lena Abraham", "introduction": "Making a rum and Coke is as simple as combining the two titular ingredients. If you'd like to be slightly more meticulous, you can measure the two out! We think our ratio (5 parts Coke to 2 parts rum) creates a perfect balance of boozy and sweet. If you'd like, add lime juice (which technically makes it a Cuba libre) and get to sippin'! Best paired with a hot and cheesy ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li> Fill a glass with ice, then add Coca-Cola and rum and stir to combine. Add lime juice if using and garnish with lime wedge.</li></ol></div>"},
{"title": "Mexican Hot Chocolate", "author": "Lena Abraham", "introduction": "When it's bone-chillingly cold, nothing warms us up faster than a mug of ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a small sauce pan over medium heat, whisk to combine milk, cinnamon, and cayenne if using. Heat, stirring occasionally, until bubbles begin to appear where the milk meets the pan.</li><li>Remove pan from heat and whisk in chocolate, vanilla, and salt until chocolate is melted. </li><li>Divide into mugs and top with marshmallows, a sprinkle of cinnamon, and chopped chocolate before serving.</li></ol></div>"},
{"title": "Cauliflower Parmesan", "author": "Laura Rege", "introduction": "is absolutely incredible, but it can cost you a lot of calories. When you're trying to be healthy, but you're really craving good Italian food, make this vegetarian cauli Parm. You won't be disappointed. ", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Preheat oven to 425°. Arrange cauliflower in a single layer on a rimmed baking sheet and brush both sides with oil. Season with salt and pepper.</li><li>Roast, flipping once, until cauliflower is tender and golden, about 35 minutes. Remove from oven and top each cauliflower steak with marinara sauce. Sprinkle with mozzarella and half of Parmesan.</li><li>Switch oven to broil and broil cauliflower until cheese is bubbly and golden in spots, about 3 minutes. Serve with remaining Parmesan, basil leaves, and red pepper flakes.</li></ol></div>"},
{"title": "Ginger Pork Potstickers", "author": "Lena Abraham", "introduction": "Looking for a weekend project? We suggest these super flavorful (and surprisingly easy) potstickers!  Don't miss the photos below of our folding technique—don't fuss too much over them, though. They'll taste amazing no matter how they look.", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>In a large bowl, combine pork, broth, white parts of green onions, garlic, soy sauce, sesame oil, ginger, fish sauce if using, and egg. Stir ingredients together using your hands or a wooden spoon until fully combined.</li><li>Line a small baking sheet with parchment paper and dust lightly with flour.</li><li>Place 4 dumpling wrappers on your work surface, and keep remaining wrappers covered with a clean kitchen towel. Place a heaping teaspoon pork filling just below center on each wrapper. Wet the edge of wrapper with water and fold top half over bottom half and pinch border to seal. Alternatively, pleat dumplings by making small folds starting on one edge and ending on the other, pinching firmly to seal after each fold. Place on prepared baking sheet and continue stuffing and sealing dumplings until all pork mixture is used.</li><li>Heat 1 tablespoon vegetable oil in a large skillet over medium heat. Add dumplings in an even layer, sealed side up. (Touching is OK!) Fry for 1 to 2 minutes, or until golden on the underside.</li><li>Add 1/3 cup water to skillet, lower heat to medium-low, and cover with a tight-fitting lid. Let steam for 3 minutes, then adjust lid so it is ajar and allowing steam to escape. Cook until no water remains, about 3 minutes more.</li><li>Use a spatula to transfer dumplings to serving plate, crisp side up. Repeat process until all dumplings are cooked.</li><li>Make dipping sauce: combine soy sauce, rice wine vinegar, and reserved green parts of green onions in a medium bowl and stir to combine. </li><li>Serve potstickers with dipping sauce on the side.</li></ol></div>"},
{"title": "Cheesy Bacon Butternut Squash", "author": "Lauren Miyashiro", "introduction": "No matter what the centerpiece of your meal is, this cheesy squash skillet is sure to steal the show. The balance of sweet, salty, and creamy is EXTREMELY addictive.", "directions": "<div class=\"direction-lists\">\n\t\t\t\t\t<ol><li>Preheat oven to to 425°. In a large ovenproof skillet (or in a large baking dish), toss butternut squash with olive oil, garlic and thyme. Season with salt and pepper, then scatter bacon on top. </li><li>Bake until the squash is tender and the bacon is cooked through, 20 to 25 minutes. </li><li>Remove skillet from oven and top with mozzarella and Parmesan. Bake for another 5 to 10 minutes, or until the cheese is melty. </li><li>Garnish with parsley and serve warm. </li></ol></div>"},
{"title": "The 66 Most Delish Spring Pastas", "author": "Sienna Livermore", "introduction": "Winter is over, but pasta is forever.", "directions": "slideshow"}
]